## staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 6 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210702182404676800000002"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_appstore_metrics:10" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_appstore_metrics:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                {
                    cpu              = 0
                    environment      = [
                        {
                            name  = "BUCKET_NAME"
                            value = "masked-metrics-snfsv-staging"
                        },
                        {
                            name  = "ENVIRONMENT"
                            value = "staging"
                        },
                        {
                            name  = "MASK_DATA"
                            value = "True"
                        },
                    ]
                    essential        = true
                    image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:latest"
                    linuxParameters  = {
                        capabilities = {
                            add  = [
                                "SYS_PTRACE",
                            ]
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/masked_appstore_metrics_ecs"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "ecs-masked-appstore-metrics"
                        }
                    }
                    mountPoints      = []
                    name             = "masked_appstore_metrics"
                    portMappings     = [
                        {
                            containerPort = 8001
                            hostPort      = 8001
                            protocol      = "tcp"
                        },
                    ]
                    volumesFrom      = []
                },
              ~ {
                  - cpu                   = 0 -> null
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - environment      = [] -> null
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_appstore_metrics" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.masked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_metrics_event_rule-terraform-20210617204945093200000002"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_metrics:47" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_metrics:47" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                {
                    cpu              = 0
                    environment      = [
                        {
                            name  = "BUCKET_NAME"
                            value = "masked-metrics-snfsv-staging"
                        },
                        {
                            name  = "ENVIRONMENT"
                            value = "staging"
                        },
                        {
                            name  = "MASK_DATA"
                            value = "True"
                        },
                    ]
                    essential        = true
                    image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
                    linuxParameters  = {
                        capabilities = {
                            add  = [
                                "SYS_PTRACE",
                            ]
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/masked_metrics_ecs"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "ecs-masked-metrics"
                        }
                    }
                    mountPoints      = []
                    name             = "masked_metrics"
                    portMappings     = [
                        {
                            containerPort = 8001
                            hostPort      = 8001
                            protocol      = "tcp"
                        },
                    ]
                    volumesFrom      = []
                },
              ~ {
                  - cpu                   = 0 -> null
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - environment      = [] -> null
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_metrics" -> (known after apply)
      ~ revision                 = 47 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_server_metrics_event_rule-terraform-20210702182404782300000005"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:16" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/masked_server_metrics:16" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                {
                    cpu              = 0
                    environment      = [
                        {
                            name  = "BUCKET_NAME"
                            value = "masked-metrics-snfsv-staging"
                        },
                        {
                            name  = "ENVIRONMENT"
                            value = "staging"
                        },
                        {
                            name  = "MASK_DATA"
                            value = "True"
                        },
                        {
                            name  = "SERVER_EVENTS_ENDPOINT"
                            value = "https://retrieval.wild-samphire.cdssandbox.xyz/events"
                        },
                    ]
                    essential        = true
                    image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:latest"
                    linuxParameters  = {
                        capabilities = {
                            add  = [
                                "SYS_PTRACE",
                            ]
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/masked_server_metrics_ecs"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "ecs-masked-server-metrics"
                        }
                    }
                    mountPoints      = []
                    name             = "masked_server_metrics"
                    portMappings     = [
                        {
                            containerPort = 8001
                            hostPort      = 8001
                            protocol      = "tcp"
                        },
                    ]
                    secrets          = [
                        {
                            name      = "metrics_token"
                            valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL"
                        },
                    ]
                    volumesFrom      = []
                },
              ~ {
                  - cpu                   = 0 -> null
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - environment      = [] -> null
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_server_metrics" -> (known after apply)
      ~ revision                 = 16 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_appstore_metrics_event_rule-terraform-20210702182404731800000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_appstore_metrics:10" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_appstore_metrics:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                {
                    cpu              = 0
                    environment      = [
                        {
                            name  = "BUCKET_NAME"
                            value = "unmasked-metrics-snfsv-staging"
                        },
                        {
                            name  = "ENVIRONMENT"
                            value = "staging"
                        },
                        {
                            name  = "MASK_DATA"
                            value = "False"
                        },
                    ]
                    essential        = true
                    image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:latest"
                    linuxParameters  = {
                        capabilities = {
                            add  = [
                                "SYS_PTRACE",
                            ]
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/unmasked_appstore_metrics_ecs"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "ecs-unmasked-appstore-metrics"
                        }
                    }
                    mountPoints      = []
                    name             = "unmasked_appstore_metrics"
                    portMappings     = [
                        {
                            containerPort = 8001
                            hostPort      = 8001
                            protocol      = "tcp"
                        },
                    ]
                    volumesFrom      = []
                },
              ~ {
                  - cpu                   = 0 -> null
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - environment      = [] -> null
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_appstore_metrics" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_metrics_event_rule-terraform-20210617204945092200000001"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_metrics:45" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_metrics:45" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                {
                    cpu              = 0
                    environment      = [
                        {
                            name  = "BUCKET_NAME"
                            value = "unmasked-metrics-snfsv-staging"
                        },
                        {
                            name  = "ENVIRONMENT"
                            value = "staging"
                        },
                        {
                            name  = "MASK_DATA"
                            value = "False"
                        },
                    ]
                    essential        = true
                    image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:latest"
                    linuxParameters  = {
                        capabilities = {
                            add  = [
                                "SYS_PTRACE",
                            ]
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/unmasked_metrics_ecs"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "ecs-unmasked-metrics"
                        }
                    }
                    mountPoints      = []
                    name             = "unmasked_metrics"
                    portMappings     = [
                        {
                            containerPort = 8001
                            hostPort      = 8001
                            protocol      = "tcp"
                        },
                    ]
                    volumesFrom      = []
                },
              ~ {
                  - cpu                   = 0 -> null
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - environment      = [] -> null
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_metrics" -> (known after apply)
      ~ revision                 = 45 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_server_metrics_event_rule-terraform-20210702182404726800000003"
      - input          = jsonencode({}) -> null
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_server_metrics:18" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/unmasked_server_metrics:17" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
                {
                    cpu              = 0
                    environment      = [
                        {
                            name  = "BUCKET_NAME"
                            value = "unmasked-metrics-snfsv-staging"
                        },
                        {
                            name  = "ENVIRONMENT"
                            value = "staging"
                        },
                        {
                            name  = "MASK_DATA"
                            value = "False"
                        },
                        {
                            name  = "SERVER_EVENTS_ENDPOINT"
                            value = "https://retrieval.wild-samphire.cdssandbox.xyz/events"
                        },
                    ]
                    essential        = true
                    image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/server-metrics-etl:latest"
                    linuxParameters  = {
                        capabilities = {
                            add  = [
                                "SYS_PTRACE",
                            ]
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/unmasked_server_metrics_ecs"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "ecs-unmasked-server-metrics"
                        }
                    }
                    mountPoints      = []
                    name             = "unmasked_server_metrics"
                    portMappings     = [
                        {
                            containerPort = 8001
                            hostPort      = 8001
                            protocol      = "tcp"
                        },
                    ]
                    secrets          = [
                        {
                            name      = "metrics_token"
                            valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-metrics-token-WfVmHL"
                        },
                    ]
                    volumesFrom      = []
                },
              ~ {
                  - cpu                   = 0 -> null
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                  - portMappings          = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - environment      = [] -> null
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_server_metrics" -> (known after apply)
      ~ revision                 = 17 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 6 to add, 6 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>